alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC1300.svd
				<register>
					<name>ICSR</name>
					<description>Interrupt Control and State Register</description>
					<addressOffset>0x0D04</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VECTACTIVE</name>
							<description>Active Exception Number</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Thread mode</description>
									<value>0x00</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VECTPENDING</name>
							<description>Pending Exception Number</description>
							<lsb>12</lsb>
							<msb>17</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No pending exceptions</description>
									<value>0x0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ISRPENDING</name>
							<description>Interrupt Pending Flag</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt not pending</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt pending.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PENDSTCLR</name>
							<description>SysTick Exception Clear-pending</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No effect</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>removes the pending state from the SysTick exception.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PENDSTSET</name>
							<description>SysTick Exception Set-pending</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>SysTick exception is not pending</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>SysTick exception is pending.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PENDSVCLR</name>
							<description>PendSV Clear Pending</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Do not clear.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Removes pending state from PendSV exception.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PENDSVSET</name>
							<description>PendSV Set Pending</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>PendSV exception is not pending.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>PendSV excepton is pending.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>AIRCR</name>
					<description>Application Interrupt and Reset Control Register</description>
					<addressOffset>0x0D0C</addressOffset>
					<size>32</size>
					<resetValue>0xFA050000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SYSRESETREQ</name>
							<description>System Reset Request</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No effect.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Requests a system level reset.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ENDIANNESS</name>
							<description>Data Endianness</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Little-endian</description>
									<value>#0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VECTKEY</name>
							<description>Register Key</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SCR</name>
					<description>System Control Register</description>
					<addressOffset>0x0D10</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SLEEPONEXIT</name>
							<description>Sleep-on-exit</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Do not sleep when returning to Thread mode.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Enter sleep, or deep sleep, on return from an ISR to Thread mode.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SLEEPDEEP</name>
							<description>Low Power Sleep Mode</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Sleep</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Deep sleep</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SEVONPEND</name>
							<description>Send Event on Pending bit</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Only enabled interrupts or events can wakeup the processor, disabled interrupts are excluded.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Enabled events and all interrupts, including disabled interrupts, can wakeup the processor.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR</name>
					<description>Configuration and Control Register</description>
					<addressOffset>0x0D14</addressOffset>
					<size>32</size>
					<resetValue>0x00000208</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>UNALIGN_TRP</name>
							<description>Unaligned Access Traps</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>STKALIGN</name>
							<description>Stack Alignment</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SHPR2</name>
					<description>System Handler Priority Register 2</description>
					<addressOffset>0x0D1C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PRI_11</name>
							<description>Priority of System Handler 11</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SHPR3</name>
					<description>System Handler Priority Register 3</description>
					<addressOffset>0x0D20</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PRI_14</name>
							<description>Priority of System Handler 14</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_15</name>
							<description>Priority of System Handler 15</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SHCSR</name>
					<description>System Handler Control and State Register</description>
					<addressOffset>0x0D24</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SVCALLPENDED</name>
							<description>SVCall Pending bit</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>SVCall is not pending.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>SVCall is pending.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
