alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC1300.svd
			</registers>
		</peripheral>
		<peripheral derivedFrom="USIC0_CH0">
			<name>USIC0_CH1</name>
			<description>Universal Serial Interface Controller 0</description>
			<groupName>USIC</groupName>
			<baseAddress>0x48000200</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x0200</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral>
			<name>SCU_GENERAL</name>
			<description>System Control Unit</description>
			<baseAddress>0x40010000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x200</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>DBGROMID</name>
					<description>Debug System ROM ID Register</description>
					<addressOffset>0x0000</addressOffset>
					<size>32</size>
					<resetValue>0x201ED083</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MANUFID</name>
							<description>Manufactory Identity</description>
							<lsb>1</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PARTNO</name>
							<description>Part Number</description>
							<lsb>12</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>VERSION</name>
							<description>Product version</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IDCHIP</name>
					<description>Chip ID Register</description>
					<addressOffset>0x0004</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>IDCHIP</name>
							<description>CHIP ID</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ID</name>
					<description>SCU Module ID Register</description>
					<addressOffset>0x0008</addressOffset>
					<size>32</size>
					<resetValue>0x00F1C000</resetValue>
					<resetMask>0xFFFFFF00</resetMask>
					<fields>
						<field>
							<name>MOD_REV</name>
							<description>Module Revision Number</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_TYPE</name>
							<description>Module Type</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_NUMBER</name>
							<description>Module Number Value</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SSW0</name>
					<description>SSW Register 0</description>
					<addressOffset>0x0014</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DAT</name>
							<description>SSW Data</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PASSWD</name>
					<description>Password Register</description>
					<addressOffset>0x0024</addressOffset>
					<size>32</size>
					<resetValue>0x00000007</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MODE</name>
							<description>Bit Protection Scheme Control Bits</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Scheme disabled - direct access to the protected bits is allowed.</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Scheme enabled - the bit field PASS has to be written with the passwords to open and close the access to the protected bits. (Default)</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PROTS</name>
							<description>Bit Protection Signal Status Bit</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Software is able to write to all protected bits.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Software is unable to write to any of the protected bits.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PASS</name>
							<description>Password Bits</description>
							<lsb>3</lsb>
							<msb>7</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Enables writing of the bit field MODE.</description>
									<value>#11000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Opens access to writing of all protected bits.</description>
									<value>#10011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Closes access to writing of all protected bits.</description>
									<value>#10101</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CCUCON</name>
					<description>CCU Control Register</description>
					<addressOffset>0x0030</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>GSC40</name>
							<description>Global Start Control CCU40</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>GSC80</name>
							<description>Global Start Control CCU80</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MIRRSTS</name>
					<description>Mirror Update Status Register</description>
					<addressOffset>0x0048</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RTC_CTR</name>
							<description>RTC CTR Mirror Register Update Status</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RTC_ATIM0</name>
							<description>RTC ATIM0 Mirror Register Update Status</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RTC_ATIM1</name>
							<description>RTC ATIM1 Mirror Register Update Status</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RTC_TIM0</name>
							<description>RTC TIM0 Mirror Register Update Status</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RTC_TIM1</name>
							<description>RTC TIM1 Mirror Register Update Status</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMTSR</name>
					<description>Parity Memory Test Select Register</description>
					<addressOffset>0x0054</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MTENS</name>
							<description>Parity Test Enable Control for 16kbytes SRAM</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>standard operation</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>generate an inverted parity bit during a write operation</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
