alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC1300.svd
				<register>
					<dim>8</dim>
					<dimIncrement>4</dimIncrement>
					<name>CHCTR[%s]</name>
					<description>Channel Ctrl. Reg.</description>
					<addressOffset>0x0200</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ICLSEL</name>
							<description>Input Class Select</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Use group-specific class 0</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Use group-specific class 1</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Use global class 0</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Use global class 1</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BNDSELL</name>
							<description>Lower Boundary Select</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Use group-specific boundary 0</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Use group-specific boundary 1</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Use global boundary 0</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Use global boundary 1</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BNDSELU</name>
							<description>Upper Boundary Select</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Use group-specific boundary 0</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Use group-specific boundary 1</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Use global boundary 0</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Use global boundary 1</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CHEVMODE</name>
							<description>Channel Event Mode</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Never</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>NCM: If result is inside the boundary band FCM: If result becomes high (above cmp. val.)</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>NCM: If result is outside the boundary band FCM: If result becomes low (below cmp. val.)</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>NCM: Always (ignore band) FCM: If result switches to either level</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYNC</name>
							<description>Synchronization Request</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No synchroniz. request, standalone operation</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Request a synchronized conversion of this channel (only taken into account for a master)</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REFSEL</name>
							<description>Reference Input Selection</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Standard reference Ground VSS</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Alternate reference Ground from CH0</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BNDSELX</name>
							<description>BoundaryExtension</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Standard mode: select boundaries via BNDSELU/BNDSELL</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Use result reg. GxRES1 as upper boundary</description>
									<value>#0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Use result reg. GxRES15 as upper boundary</description>
									<value>#1111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESREG</name>
							<description>Result Register</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Store result in group result register GxRES0</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Store result in group result register GxRES15</description>
									<value>#1111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESTBS</name>
							<description>Result Target for Background Source</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Store results in the selected group result register</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Store results in the global result register</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESPOS</name>
							<description>Result Position</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Store results left-aligned</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Store results right-aligned</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BWDCH</name>
							<description>Broken Wire Detection Channel</description>
							<lsb>28</lsb>
							<msb>29</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Select VAREF</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Select VAGND</description>
									<value>#01</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BWDEN</name>
							<description>Broken Wire Detection Enable</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Normal operation</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Additional preparation phase is enabled</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<dim>16</dim>
					<dimIncrement>4</dimIncrement>
					<name>RCR[%s]</name>
					<description>Result Control Reg.</description>
					<addressOffset>0x0280</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DRCTR</name>
							<description>Data Reduction Control</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DMM</name>
							<description>Data Modification Mode</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Standard data reduction (accumulation)</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Result filtering mode</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Difference mode</description>
									<value>#10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WFR</name>
							<description>Wait-for-Read Mode Enable</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Overwrite mode</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Wait-for-read mode enabled for this register</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FEN</name>
							<description>FIFO Mode Enable</description>
							<lsb>25</lsb>
							<msb>26</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Separate result register</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Part of a FIFO structure: copy each new valid result</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Maximum mode: copy new result if bigger</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Minimum mode: copy new result if smaller</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SRGEN</name>
							<description>Service Request Generation Enable</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No service request</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Service request after a result event</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<dim>16</dim>
					<dimIncrement>4</dimIncrement>
					<name>RES[%s]</name>
					<description>Result Register</description>
					<addressOffset>0x0300</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<readAction>modifyExternal</readAction>
					<fields>
						<field>
							<name>RESULT</name>
							<description>Result of Most Recent Conversion</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DRC</name>
							<description>Data Reduction Counter</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CHNR</name>
							<description>Channel Number</description>
							<lsb>20</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EMUX</name>
							<description>External Multiplexer Setting</description>
							<lsb>25</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CRS</name>
							<description>Converted Request Source</description>
							<lsb>28</lsb>
							<msb>29</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Request source 0</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Request source 1</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Request source 2</description>
									<value>#10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FCR</name>
							<description>Fast Compare Result</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Signal level was below compare value</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Signal level was above compare value</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VF</name>
							<description>Valid Flag</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No new result available</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Bitfield RESULT has been updated with new result value and has not yet been read, or bit FCR has been updated</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<dim>16</dim>
					<dimIncrement>4</dimIncrement>
					<name>RESD[%s]</name>
					<description>Result Register, Debug</description>
					<addressOffset>0x0380</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESULT</name>
							<description>Result of Most Recent Conversion</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DRC</name>
							<description>Data Reduction Counter</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CHNR</name>
							<description>Channel Number</description>
							<lsb>20</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EMUX</name>
							<description>External Multiplexer Setting</description>
							<lsb>25</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CRS</name>
							<description>Converted Request Source</description>
							<lsb>28</lsb>
							<msb>29</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Request source 0</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Request source 1</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Request source 2</description>
									<value>#10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FCR</name>
							<description>Fast Compare Result</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Signal level was below compare value</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Signal level was above compare value</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VF</name>
							<description>Valid Flag</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No new result available</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Bitfield RESULT has been updated with new result value and has not yet been read, or bit FCR has been updated</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
