alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC1300.svd
				<register>
					<name>CHOCON</name>
					<description>Channel Output Control</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CH0OP</name>
							<description>Channel 0 Output Passive Level</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Active high</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Active low</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH1OP</name>
							<description>Channel 1 Output Passive Level</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Active high</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Active low</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH2OP</name>
							<description>Channel 2 Output Passive Level</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Active high</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Active low</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH3OP</name>
							<description>Channel 3 Output Passive Level</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Active high</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Active low</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH4OP</name>
							<description>Channel 4 Output Passive Level</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Active high</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Active low</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH5OP</name>
							<description>Channel 5 Output Passive Level</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Active high</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Active low</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH6OP</name>
							<description>Channel 6 Output Passive Level</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Active high</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Active low</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH7OP</name>
							<description>Channel 7 Output Passive Level</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Active high</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Active low</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH8OP</name>
							<description>Channel 8 Output Passive Level</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Active high</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Active low</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH0TPE</name>
							<description>Channel 0 Trap Enable</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Trap function on channel is disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Trap function on channel is enabled, the output goes to passive level when trap occurs</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH1TPE</name>
							<description>Channel 1 Trap Enable</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Trap function on channel is disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Trap function on channel is enabled, the output goes to passive level when trap occurs</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH2TPE</name>
							<description>Channel 2 Trap Enable</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Trap function on channel is disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Trap function on channel is enabled, the output goes to passive level when trap occurs</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH3TPE</name>
							<description>Channel 3 Trap Enable</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Trap function on channel is disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Trap function on channel is enabled, the output goes to passive level when trap occurs</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH4TPE</name>
							<description>Channel 4 Trap Enable</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Trap function on channel is disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Trap function on channel is enabled, the output goes to passive level when trap occurs</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH5TPE</name>
							<description>Channel 5 Trap Enable</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Trap function on channel is disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Trap function on channel is enabled, the output goes to passive level when trap occurs</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH6TPE</name>
							<description>Channel 6 Trap Enable</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Trap function on channel is disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Trap function on channel is enabled, the output goes to passive level when trap occurs</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH7TPE</name>
							<description>Channel 7 Trap Enable</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Trap function on channel is disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Trap function on channel is enabled, the output goes to passive level when trap occurs</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH8TPE</name>
							<description>Channel 8 Trap Enable</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Trap function on channel is disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Trap function on channel is enabled, the output goes to passive level when trap occurs</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CHTRIG</name>
					<description>Channel Trigger</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ET0</name>
							<description>Channel 0 Trigger Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Channel trigger is disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Channel trigger is enabled</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ET1</name>
							<description>Channel 1 Trigger Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Channel trigger is disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Channel trigger is enabled</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ET2</name>
							<description>Channel 2 Trigger Enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Channel trigger is disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Channel trigger is enabled</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ET3</name>
							<description>Channel 3 Trigger Enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Channel trigger is disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Channel trigger is enabled</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ET4</name>
							<description>Channel 4 Trigger Enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Channel trigger is disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Channel trigger is enabled</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ET5</name>
							<description>Channel 5 Trigger Enable</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Channel trigger is disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Channel trigger is enabled</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ET6</name>
							<description>Channel 6 Trigger Enable</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Channel trigger is disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Channel trigger is enabled</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ET7</name>
							<description>Channel 7 Trigger Enable</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Channel trigger is disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Channel trigger is enabled</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ET8</name>
							<description>Channel 8 Trigger Enable</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Channel trigger is disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Channel trigger is enabled</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TOS0</name>
							<description>Channel 0 Trigger Output Select</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The channel trigger pulse will appear on BCCU_TRIGOUT0</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The channel trigger pulse will appear on BCCU_TRIGOUT1</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TOS1</name>
							<description>Channel 1 Trigger Output Select</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The channel trigger pulse will appear on BCCU_TRIGOUT0</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The channel trigger pulse will appear on BCCU_TRIGOUT1</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TOS2</name>
							<description>Channel 2 Trigger Output Select</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The channel trigger pulse will appear on BCCU_TRIGOUT0</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The channel trigger pulse will appear on BCCU_TRIGOUT1</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TOS3</name>
							<description>Channel 3 Trigger Output Select</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The channel trigger pulse will appear on BCCU_TRIGOUT0</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The channel trigger pulse will appear on BCCU_TRIGOUT1</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TOS4</name>
							<description>Channel 4 Trigger Output Select</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The channel trigger pulse will appear on BCCU_TRIGOUT0</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The channel trigger pulse will appear on BCCU_TRIGOUT1</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TOS5</name>
							<description>Channel 5 Trigger Output Select</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The channel trigger pulse will appear on BCCU_TRIGOUT0</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The channel trigger pulse will appear on BCCU_TRIGOUT1</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TOS6</name>
							<description>Channel 6 Trigger Output Select</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The channel trigger pulse will appear on BCCU_TRIGOUT0</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The channel trigger pulse will appear on BCCU_TRIGOUT1</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TOS7</name>
							<description>Channel 7 Trigger Output Select</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The channel trigger pulse will appear on BCCU_TRIGOUT0</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The channel trigger pulse will appear on BCCU_TRIGOUT1</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TOS8</name>
							<description>Channel 8 Trigger Output Select</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The channel trigger pulse will appear on BCCU_TRIGOUT0</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The channel trigger pulse will appear on BCCU_TRIGOUT1</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
